In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../data/messy_Data.csv')

In [4]:
df.head()

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
0,0,1e407ff9-6255-489d-a0de-34135d4f74bd,Hunter Thomas,25.0,xlopez@hotmail.com,NaN,88552.0,Sales
1,1,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.0,NaN
2,2,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.0,Engineering
3,3,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.0,SupportJ
4,4,14ed3e6a-e0f5-4bbe-8d93-8665267f5c90,Julia Lee,71.0,figueroakayla@yahoo.com,NaN,143456.0,Marketing

In [5]:
# Null values
print("Missing values per column:")
print(df.isnull().sum())

Missing values per column:
Unnamed: 0       0
ID               0
Name          2333
Age           1747
Email         1269
Join Date     2192
Salary        2239
Department    2255
dtype: int64

In [6]:
# Duplicates
print("\nDuplicate rows:")
print(df.duplicated().sum())

Duplicate rows:
291

In [7]:
# Check email issues
print("\nInvalid emails:")
invalid_emails = df[~df['Email'].str.contains(r'^[\w\.-]+@[\w\.-]+\.\w+$', na=False)]
display(invalid_emails)

Invalid emails:

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
1,1,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.0,NaN
2,2,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.0,Engineering
3,3,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.0,SupportJ
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.0,pperkinshotmail.com,17/09/2020,77311.0,HR
7,7,465e625b-f924-4061-8356-c7e3130f7118,Derek Murphy,38.0,josephrobertsongmail.com,2021-01-12,NaN,Support
...,...,...,...,...,...,...,...,...
10978,3054,1ea7f125-698d-49dc-a97a-955b4dc4fc9b,NaN,NaN,NaN,NaN,NaN,NaN
10988,6403,4edd1e6e-cfb5-4300-9c74-e9642836e134,NaN,NaN,NaN,NaN,NaN,NaN
10993,9510,796f8c0b-15a4-475c-bb02-ac892df0c746,Shelley Hopkinslive,79.0,Michael Walker,25/12/1992,47809.0,HR
10995,6523,07c223be-03e6-4f70-a2b5-86df778cc61a,NaN,NaN,NaN,NaN,NaN,NaN
10996,9785,da8a6bbc-5026-4630-848d-f64e80dac56c,Steven Armstrong,38.0,molly89gmail.com,2021-06-24,NaN,Sales

In [8]:
# Check department typos
print("\nUnique departments:")
print(df['Department'].unique())

Unique departments:
['Sales' nan 'Engineering' 'SupportJ' 'Marketing' 'SupportE' 'HR'
 'Support' 'HRC' 'SalesA' 'SalesX' 'Supportu' 'Engineeringi' 'MarketingR'
 'Salesw' 'SalesK' 'MarketingU' 'Salesi' 'HRa' 'SalesG' 'Supporty'
 'SalesN' 'Marketinge' 'Marketingv' 'HRv' 'SalesM' 'EngineeringL'
 'MarketingQ' 'HRs' 'SalesW' 'Supportj' 'Salesd' 'Marketingu'
 'Engineeringj' 'SalesU' 'HRO' 'MarketingH' 'Salesj' 'Saleso' 'SalesZ'
 'Engineeringe' 'MarketingF' 'Marketingr' 'Engineeringm' 'HRW' 'HRt' 'HRz'
 'Engineeringp' 'HRF' 'EngineeringS' 'SupportW' 'EngineeringT' 'SalesC'
 'SalesB' 'SupportC' 'SalesY' 'Marketingn' 'EngineeringK' 'Marketingz'
 'HRo' 'SupportB' 'HRi' 'Salest' 'Supportg' 'Supporta' 'HRn' 'SupportQ'
 'Salesr' 'EngineeringG' 'Supportm' 'Supporto' 'EngineeringH' 'Marketingw'
 'EngineeringM' 'Supportz' 'HRr' 'Salesy' 'MarketingD' 'HRE' 'Marketingm'
 'HRw' 'Marketingo' 'Supportk' 'MarketingN' 'SupportS' 'EngineeringD'
 'Marketingp' 'Salesl' 'MarketingI' 'MarketingL' 'SupportT' 'Engineeringn'
 'MarketingO' 'SalesF' 'Salesz' 'Marketingt' 'Engineeringv' 'HRL' 'HRI'
 'EngineeringR' 'HRD' 'Marketingk' 'HRQ' 'Salese' 'Saless' 'Marketingi'
 'Salesn' 'Engineeringl' 'SalesE' 'HRy' 'EngineeringE' 'SalesD' 'HRm'
 'Engineerings' 'SupportF' 'Marketingy' 'MarketingG' 'SalesI' 'Salesu'
 'Engineeringg' 'EngineeringQ' 'MarketingE' 'SupportA' 'Engineeringq'
 'EngineeringA' 'Supporte' 'Engineeringu' 'EngineeringO' 'SalesS'
 'Supportv' 'HRK' 'Engineeringb' 'SalesV' 'HRT' 'SupportY' 'SalesQ'
 'MarketingX' 'Supportp' 'Marketingf' 'HRU' 'HRp' 'Salesq' 'HRg'
 'Marketingl' 'EngineeringV' 'Engineeringt' 'SupportO' 'SalesJ'
 'EngineeringX' 'Engineeringc' 'Marketingh' 'EngineeringC' 'Engineeringz'
 'HRP' 'Salesv' 'Engineeringk' 'SupportH' 'Salesk' 'Supporth' 'SupportZ'
 'Supportq' 'Supportr' 'HRJ' 'Supportd' 'HRZ' 'MarketingZ' 'Salesc'
 'EngineeringJ' 'Engineeringx' 'SalesR' 'Engineeringh' 'Supportl'
 'SupportX' 'Marketingg' 'SalesH' 'MarketingC' 'SupportV' 'HRq'
 'Marketingb' 'Supporti' 'Supportw' 'SupportL' 'Marketings' 'Marketingq'
 'HRM' 'Supportt' 'HRX' 'HRl' 'EngineeringF' 'SupportP' 'HRf' 'MarketingB'
 'Engineeringf' 'EngineeringW' 'HRB' 'Engineeringy' 'Marketinga' 'HRj'
 'HRd' 'SupportI' 'HRA' 'Marketingj' 'MarketingV' 'EngineeringI' 'HRY'
 'EngineeringZ' 'MarketingY' 'Marketingx' 'HRH' 'HRN' 'MarketingJ'
 'MarketingW' 'HRh' 'Supportb' 'SalesT' 'Supportn' 'Engineeringa'
 'SupportG' 'SalesO' 'SupportK' 'Engineeringd' 'HRk' 'Marketingd'
 'MarketingS' 'MarketingT' 'HRR' 'Engineeringw' 'Salesg' 'HRb' 'SupportN'
 'Marketingc' 'EngineeringU' 'Supportx' 'Salesp' 'HRu' 'MarketingK'
 'SalesL' 'Salesx' 'SupportD' 'Supports' 'Salesm' 'Engineeringr' 'HRe'
 'SupportM' 'MarketingM' 'SupportR' 'SupportU' 'Salesa' 'Salesf'
 'Supportf' 'Salesh' 'Salesb' 'EngineeringB' 'HRG' 'Engineeringo'
 'EngineeringN' 'HRV' 'HRS' 'SalesP' 'Supportc' 'HRx' 'EngineeringP' 'HRc'
 'MarketingP' 'MarketingA']

In [9]:
# Check noisy name field
df['Name'].sample(25)

3068         Chase Valencia
4047        Whitney Montoya
10091         Matthew Yates
4698                    NaN
7498         Matthew Harris
7798        Timothy Miranda
8209              Mary Cain
6865       Samantha Mcbride
10795       Eric Davisthose
9953           Edward Wells
6342        Jeffrey Collins
2328        Mrs. Jill Avila
752             Ryan Brooks
4969       Alexander Tucker
8418         John Smithhave
10683                   NaN
6615                    NaN
4337     Manuel Colemangirl
2275           Joshua Avila
8577          Alyssa Garcia
5184          Charles Mayer
5619                    NaN
283             Kevin Evans
2771     Shawn Fitzgeraldok
10171                   NaN
Name: Name, dtype: object

In [10]:
# Drop rows where 'Join Date' is missing
df = df.dropna(subset=['Join Date'])

In [11]:
# Fill missing Age with average age
df['Age'] = df['Age'].fillna(df['Age'].mean())

# Fill missing Department with 'Unknown'
df['Department'] = df['Department'].fillna('Unknown')

In [12]:
# Count missing values per column
print("Missing values:")
print(df.isnull().sum())

Missing values:
Unnamed: 0      0
ID              0
Name          968
Age             0
Email           0
Join Date       0
Salary        879
Department      0
dtype: int64

In [13]:
# Drop rows with missing Join Date
df = df.dropna(subset=['Join Date'])

In [14]:
# Fill missing Age with average age
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [15]:
# Drop rows with missing Salary
df = df.dropna(subset=['Salary'])

In [16]:
df['Department'] = df['Department'].fillna('Unknown')

In [17]:
df = df.dropna(subset=['Email'])

In [18]:
# Confirm all missing values are handled
print("Remaining nulls:\n", df.isnull().sum())

Remaining nulls:
 Unnamed: 0      0
ID              0
Name          868
Age             0
Email           0
Join Date       0
Salary          0
Department      0
dtype: int64

In [19]:
# Check for missing IDs
print("Missing IDs:", df['ID'].isnull().sum())

# Check for duplicate IDs
print("Duplicate IDs:", df['ID'].duplicated().sum())

Missing IDs: 0
Duplicate IDs: 663

In [20]:
# Show suspicious names
df[df['Name'].str.contains(r'[^a-zA-Z\s]', na=False)]  # symbols/numbers

# Check short or missing names
df[df['Name'].str.len() < 3]

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [21]:
# Check age range
df['Age'].describe()

# Show extreme ages
df[(df['Age'] < 15) | (df['Age'] > 100)]

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [22]:
# Missing or invalid email
df[~df['Email'].str.contains(r'^[\w\.-]+@[\w\.-]+\.\w+$', na=False)]

# Personal/free email domains
df[df['Email'].str.contains('gmail|yahoo|hotmail', case=False, na=False)]

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.0,pperkinshotmail.com,17/09/2020,77311.000000,HR
8,8,12cc2f16-d641-402e-b22b-3332bafc4f1d,NaN,71.0,andrew74@hotmail.com,2022-02-12,83354.000000,Sales
11,11,21763907-db1a-400a-8464-e3af593c3abc,Raymond Wilson,44.0,katherinewallacehotmail.com,2021-08-26,128335.000000,HRC
12,12,da63d159-e9b0-4b92-b0fe-4e87df3aebc1,Amber Marsh,23.0,robert43@gmail.com,2023-09-08,112970.000000,Engineering
13,13,5ca27087-5c90-4d42-94d0-7e9ee3f422b9,Patrick Mooney,57.0,bowersjasmine@hotmail.com,2023-06-24,41511.139646,SalesA
...,...,...,...,...,...,...,...,...
10982,5701,863c0f7c-8241-4dfc-86a3-d73b7ce493e8,Tina Friedman,59.0,raygabrielle@hotmail.com,2023-09-30,150844.398497,Marketing
10983,5778,eea8dacc-5c7f-488a-b37e-448cc29799d5,NaN,55.0,ealexander@yahoo.com,2020-09-11,106142.000000,Marketing
10984,2738,e198cca1-70c0-465d-8459-82f5b0e71163,Alexandra Hansen,38.0,weavermary@yahoo.com,2022-02-13,67036.000000,Marketing
10989,5620,4d450808-7caf-432e-bf65-385e715b43fe,Richard Leonard,58.0,luis19@gmail.com,01/05/1982,103005.000000,HRJ
10992,7429,749e71e0-f852-4749-bae3-b59b9c5a9e77,NaN,31.0,kingcharles@hotmail.com,2020-11-28,88530.000000,Marketing

In [23]:
# Try to convert join date
df['Join Date'] = pd.to_datetime(df['Join Date'], errors='coerce')

# Invalid dates become NaT
df[df['Join Date'].isnull()]

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
5,5,f92ea13f-24d3-4792-91e4-5b0e07d90c2c,Lisa Bailey,81.000000,milleryvonne@fowler-york.com,NaT,123018.000000,SupportE
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.000000,pperkinshotmail.com,NaT,77311.000000,HR
14,14,9b83a5e5-9516-493f-86f8-d6c445edb501,Nicole Cardenas,60.000000,griffinlinda@harrison.com,NaT,51625.814403,Marketing
16,16,241e20d7-cc36-495e-86c2-2928bbaa93d8,Mark Wilkins,54.036516,longjennifer@parker.biz,NaT,85794.000000,SalesX
23,23,13b6428a-ba54-4531-87a1-72c3c3ccf765,Laura Davis,60.000000,garciaralph@hayes-hernandez.biz,NaT,61209.000000,Engineeringi
...,...,...,...,...,...,...,...,...
10970,2796,4bd30b58-8811-4d28-a217-71fbbcab62fe,Brandon Hernandez,38.000000,pjones@hotmail.com,NaT,46705.000000,Engineering
10977,9062,f197eeea-6d40-44b9-ab25-abdde24dec54,Nicholas Chavezsituation,86.000000,cjohnsonhotmail.com,NaT,29196.703578,Unknown
10989,5620,4d450808-7caf-432e-bf65-385e715b43fe,Richard Leonard,58.000000,luis19@gmail.com,NaT,103005.000000,HRJ
10993,9510,796f8c0b-15a4-475c-bb02-ac892df0c746,Shelley Hopkinslive,79.000000,Michael Walker,NaT,47809.000000,HR
10997,7826,ed19c966-d6d8-4047-b410-b6e595a39340,Stephanie Riossell,54.036516,robert96@pollard-frye.com,NaT,122609.594149,HR

In [24]:
# Remove formatting if needed
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

# Check outliers
df['Salary'].describe()
df[df['Salary'] > 300000]  # Adjust threshold

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [25]:
# Unique values
df['Department'].unique()

array(['Unknown', 'Engineering', 'SupportJ', 'SupportE', 'HR', 'Sales',
       'HRC', 'SalesA', 'Marketing', 'SalesX', 'Supportu', 'Engineeringi',
       'Salesw', 'SalesK', 'MarketingU', 'Salesi', 'HRa', 'Support',
       'SalesG', 'Supporty', 'SalesN', 'Marketinge', 'MarketingR', 'HRv',
       'SalesM', 'EngineeringL', 'MarketingQ', 'HRs', 'SalesW',
       'Supportj', 'Salesd', 'Marketingu', 'Engineeringj', 'SalesU',
       'HRO', 'MarketingH', 'Salesj', 'Saleso', 'Engineeringe',
       'MarketingF', 'Marketingr', 'Engineeringm', 'HRW', 'HRz',
       'Engineeringp', 'HRF', 'EngineeringS', 'EngineeringT', 'SalesC',
       'SalesB', 'SupportC', 'SalesY', 'Marketingn', 'EngineeringK',
       'Marketingz', 'HRo', 'SupportB', 'HRi', 'Salest', 'Supporta',
       'HRn', 'SupportQ', 'Salesr', 'Supportm', 'Supporto',
       'EngineeringH', 'Marketingw', 'EngineeringM', 'Supportz', 'Salesy',
       'HRE', 'Marketingm', 'HRw', 'Marketingo', 'Supportk', 'MarketingN',
       'SupportS', 'EngineeringD', 'Marketingp', 'Salesl', 'MarketingI',
       'MarketingL', 'Engineeringn', 'MarketingO', 'SalesF', 'Salesz',
       'Marketingt', 'Engineeringv', 'HRL', 'HRI', 'EngineeringR',
       'Marketingk', 'HRQ', 'Salese', 'Saless', 'Marketingi', 'Salesn',
       'SalesE', 'HRy', 'SalesD', 'Engineerings', 'SupportF',
       'Marketingy', 'MarketingG', 'SalesI', 'Salesu', 'Engineeringg',
       'EngineeringQ', 'MarketingE', 'SupportA', 'Engineeringq',
       'EngineeringA', 'Supporte', 'Engineeringu', 'EngineeringO',
       'SalesS', 'Supportv', 'HRK', 'Engineeringb', 'SalesV', 'HRT',
       'SupportY', 'SalesQ', 'MarketingX', 'Supportp', 'HRr', 'HRU',
       'HRt', 'Salesq', 'HRg', 'Marketingl', 'EngineeringV',
       'Engineeringt', 'SupportO', 'MarketingD', 'EngineeringX',
       'Marketingh', 'EngineeringC', 'Engineeringz', 'HRP', 'Salesv',
       'Engineeringk', 'SupportH', 'SupportZ', 'Supportq', 'Supportr',
       'HRJ', 'Supportd', 'HRZ', 'MarketingZ', 'Salesc', 'EngineeringJ',
       'Engineeringx', 'SalesR', 'Supportl', 'HRm', 'Marketingg',
       'EngineeringG', 'SalesH', 'MarketingC', 'SupportV', 'HRq',
       'Engineeringc', 'Supportw', 'SupportL', 'Marketings', 'Marketingq',
       'Supportt', 'SupportX', 'HRl', 'EngineeringF', 'SupportP',
       'Engineeringf', 'EngineeringW', 'HRB', 'Engineeringy', 'HRj',
       'HRd', 'Supporth', 'SupportI', 'HRA', 'HRp', 'EngineeringI', 'HRY',
       'EngineeringZ', 'MarketingY', 'Marketingb', 'MarketingV', 'HRM',
       'Supporti', 'Marketingx', 'HRH', 'HRN', 'MarketingJ',
       'Engineeringh', 'MarketingW', 'HRh', 'Supportb', 'SalesT',
       'Supportn', 'Engineeringa', 'SupportG', 'SalesO', 'Marketingf',
       'SupportK', 'Engineeringd', 'HRk', 'Marketingd', 'MarketingS',
       'MarketingT', 'Engineeringw', 'Salesg', 'HRb', 'SupportN',
       'Marketingc', 'EngineeringE', 'EngineeringU', 'Supportx',
       'MarketingB', 'Salesp', 'Salesk', 'HRu', 'SalesL', 'Salesx',
       'Marketinga', 'SupportD', 'Supports', 'Salesm', 'Engineeringr',
       'Marketingj', 'SupportM', 'MarketingM', 'SupportR', 'HRX',
       'SalesJ', 'SupportU', 'Salesa', 'Salesf', 'Engineeringl',
       'Supportf', 'SalesZ', 'Salesh', 'Salesb', 'EngineeringB', 'HRG',
       'Engineeringo', 'HRe', 'EngineeringN', 'HRV', 'HRR', 'HRS',
       'Supportc', 'MarketingK', 'Marketingv', 'EngineeringP', 'HRf',
       'SalesP', 'SupportT', 'SupportW', 'HRc', 'Supportg', 'HRD',
       'MarketingP', 'MarketingA'], dtype=object)

In [26]:
df['Age'].dtype

dtype('float64')

In [27]:
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

In [28]:
df['Age'].describe()

count    7929.000000
mean       54.089183
std        20.467149
min        18.000000
25%        37.000000
50%        54.036516
75%        71.000000
max        90.000000
Name: Age, dtype: float64

In [29]:
df[(df['Age'] < 15) | (df['Age'] > 100)]

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [30]:
df = df[(df['Age'] >= 15) & (df['Age'] <= 100)]

In [31]:
df.loc[df['Age'] > 100, 'Age'] = df['Age'].median()  # Or any safe number

In [32]:
# Emails that do NOT match the standard format
invalid_emails = df[~df['Email'].str.contains(r'^[\w\.-]+@[\w\.-]+\.\w+$', na=False)]
print("Invalid emails:", invalid_emails.shape[0])
invalid_emails.head()

Invalid emails: 1965

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
1,1,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.0,Unknown
2,2,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.0,Engineering
3,3,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.0,SupportJ
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.0,pperkinshotmail.com,NaT,77311.0,HR
11,11,21763907-db1a-400a-8464-e3af593c3abc,Raymond Wilson,44.0,katherinewallacehotmail.com,2021-08-26,128335.0,HRC

In [33]:
# Check for personal emails
personal_emails = df[df['Email'].str.contains(r'gmail|yahoo|hotmail|rediff', case=False, na=False)]
print("Personal emails:", personal_emails.shape[0])
personal_emails.head()

Personal emails: 3795

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.0,pperkinshotmail.com,NaT,77311.000000,HR
8,8,12cc2f16-d641-402e-b22b-3332bafc4f1d,NaN,71.0,andrew74@hotmail.com,2022-02-12,83354.000000,Sales
11,11,21763907-db1a-400a-8464-e3af593c3abc,Raymond Wilson,44.0,katherinewallacehotmail.com,2021-08-26,128335.000000,HRC
12,12,da63d159-e9b0-4b92-b0fe-4e87df3aebc1,Amber Marsh,23.0,robert43@gmail.com,2023-09-08,112970.000000,Engineering
13,13,5ca27087-5c90-4d42-94d0-7e9ee3f422b9,Patrick Mooney,57.0,bowersjasmine@hotmail.com,2023-06-24,41511.139646,SalesA

In [34]:
# Check unique department names
print("Unique department names:\n", df['Department'].unique())

Unique department names:
 ['Unknown' 'Engineering' 'SupportJ' 'SupportE' 'HR' 'Sales' 'HRC' 'SalesA'
 'Marketing' 'SalesX' 'Supportu' 'Engineeringi' 'Salesw' 'SalesK'
 'MarketingU' 'Salesi' 'HRa' 'Support' 'SalesG' 'Supporty' 'SalesN'
 'Marketinge' 'MarketingR' 'HRv' 'SalesM' 'EngineeringL' 'MarketingQ'
 'HRs' 'SalesW' 'Supportj' 'Salesd' 'Marketingu' 'Engineeringj' 'SalesU'
 'HRO' 'MarketingH' 'Salesj' 'Saleso' 'Engineeringe' 'MarketingF'
 'Marketingr' 'Engineeringm' 'HRW' 'HRz' 'Engineeringp' 'HRF'
 'EngineeringS' 'EngineeringT' 'SalesC' 'SalesB' 'SupportC' 'SalesY'
 'Marketingn' 'EngineeringK' 'Marketingz' 'HRo' 'SupportB' 'HRi' 'Salest'
 'Supporta' 'HRn' 'SupportQ' 'Salesr' 'Supportm' 'Supporto' 'EngineeringH'
 'Marketingw' 'EngineeringM' 'Supportz' 'Salesy' 'HRE' 'Marketingm' 'HRw'
 'Marketingo' 'Supportk' 'MarketingN' 'SupportS' 'EngineeringD'
 'Marketingp' 'Salesl' 'MarketingI' 'MarketingL' 'Engineeringn'
 'MarketingO' 'SalesF' 'Salesz' 'Marketingt' 'Engineeringv' 'HRL' 'HRI'
 'EngineeringR' 'Marketingk' 'HRQ' 'Salese' 'Saless' 'Marketingi' 'Salesn'
 'SalesE' 'HRy' 'SalesD' 'Engineerings' 'SupportF' 'Marketingy'
 'MarketingG' 'SalesI' 'Salesu' 'Engineeringg' 'EngineeringQ' 'MarketingE'
 'SupportA' 'Engineeringq' 'EngineeringA' 'Supporte' 'Engineeringu'
 'EngineeringO' 'SalesS' 'Supportv' 'HRK' 'Engineeringb' 'SalesV' 'HRT'
 'SupportY' 'SalesQ' 'MarketingX' 'Supportp' 'HRr' 'HRU' 'HRt' 'Salesq'
 'HRg' 'Marketingl' 'EngineeringV' 'Engineeringt' 'SupportO' 'MarketingD'
 'EngineeringX' 'Marketingh' 'EngineeringC' 'Engineeringz' 'HRP' 'Salesv'
 'Engineeringk' 'SupportH' 'SupportZ' 'Supportq' 'Supportr' 'HRJ'
 'Supportd' 'HRZ' 'MarketingZ' 'Salesc' 'EngineeringJ' 'Engineeringx'
 'SalesR' 'Supportl' 'HRm' 'Marketingg' 'EngineeringG' 'SalesH'
 'MarketingC' 'SupportV' 'HRq' 'Engineeringc' 'Supportw' 'SupportL'
 'Marketings' 'Marketingq' 'Supportt' 'SupportX' 'HRl' 'EngineeringF'
 'SupportP' 'Engineeringf' 'EngineeringW' 'HRB' 'Engineeringy' 'HRj' 'HRd'
 'Supporth' 'SupportI' 'HRA' 'HRp' 'EngineeringI' 'HRY' 'EngineeringZ'
 'MarketingY' 'Marketingb' 'MarketingV' 'HRM' 'Supporti' 'Marketingx'
 'HRH' 'HRN' 'MarketingJ' 'Engineeringh' 'MarketingW' 'HRh' 'Supportb'
 'SalesT' 'Supportn' 'Engineeringa' 'SupportG' 'SalesO' 'Marketingf'
 'SupportK' 'Engineeringd' 'HRk' 'Marketingd' 'MarketingS' 'MarketingT'
 'Engineeringw' 'Salesg' 'HRb' 'SupportN' 'Marketingc' 'EngineeringE'
 'EngineeringU' 'Supportx' 'MarketingB' 'Salesp' 'Salesk' 'HRu' 'SalesL'
 'Salesx' 'Marketinga' 'SupportD' 'Supports' 'Salesm' 'Engineeringr'
 'Marketingj' 'SupportM' 'MarketingM' 'SupportR' 'HRX' 'SalesJ' 'SupportU'
 'Salesa' 'Salesf' 'Engineeringl' 'Supportf' 'SalesZ' 'Salesh' 'Salesb'
 'EngineeringB' 'HRG' 'Engineeringo' 'HRe' 'EngineeringN' 'HRV' 'HRR'
 'HRS' 'Supportc' 'MarketingK' 'Marketingv' 'EngineeringP' 'HRf' 'SalesP'
 'SupportT' 'SupportW' 'HRc' 'Supportg' 'HRD' 'MarketingP' 'MarketingA']

In [35]:
df['Department'] = df['Department'].replace({
    'Hr': 'HR',
    'Engneering': 'Engineering',
    'Marketng': 'Marketing',
    'Saless': 'Sales',
    'Supporrt': 'Support',
    'SupportJ': 'Support'
})

In [36]:
# Remove symbols first (if needed)
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

# Check range
print("Salary Stats:\n", df['Salary'].describe())

# Check extreme high salaries
df[df['Salary'] > 300000].head()

# Check zero or very low salaries
df[df['Salary'] < 1000].head()

Salary Stats:
 count      7929.000000
mean      90061.277092
std       34733.189632
min       24655.136613
25%       60147.000000
50%       89245.000000
75%      119429.000000
max      176156.206747
Name: Salary, dtype: float64

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [37]:
# Names with special characters
df[df['Name'].str.contains(r'[^a-zA-Z\s]', na=False)].head()

# Unusually long names
df[df['Name'].str.len() > 30].head()

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
5343,5343,fdd4537d-5be3-42e3-ab2d-5bdfaf68eac8,Mrs. Jacqueline Davis DVMparent,78.0,dennis09smith.com,2021-11-03,107196.000000,Marketing
7829,7829,d45b44ae-b0d7-4899-9bb7-ae797b00f8ab,Dr. Clifford Carrillo IIpopular,18.0,charles26@rivera-meyer.com,NaT,152321.214592,Support

In [38]:
df = df.drop_duplicates(subset='ID', keep='first')

In [39]:
# Convert to numeric if not already
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

# Remove age outliers (<15 or >100)
df = df[(df['Age'] >= 15) & (df['Age'] <= 100)]

In [40]:
# Remove invalid emails
df = df[df['Email'].str.contains(r'^[\w\.-]+@[\w\.-]+\.\w+$', na=False)]

# Remove personal email domains
df = df[~df['Email'].str.contains('gmail|yahoo|hotmail|rediff', case=False, na=False)]

In [41]:
# Fix typos
df['Department'] = df['Department'].replace({
    'Hr': 'HR',
    'Engneering': 'Engineering',
    'Marketng': 'Marketing',
    'Saless': 'Sales',
    'Supporrt': 'Support',
    'SupportJ': 'Support'
})

# Optional: Replace missing departments
df['Department'] = df['Department'].fillna('Unknown')

In [42]:
# Remove numbers/symbols and standardize case
df['Name'] = df['Name'].str.replace(r'[^a-zA-Z\s]', '', regex=True)
df['Name'] = df['Name'].str.strip().str.title()

In [43]:
df['Join Date'] = pd.to_datetime(df['Join Date'], errors='coerce')

# Drop rows with invalid/missing Join Date
df = df.dropna(subset=['Join Date'])

In [44]:
# Convert to numeric if needed
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

# Remove unrealistic salaries
df = df[(df['Salary'] >= 1000) & (df['Salary'] <= 300000)]

In [45]:
df.to_csv('../data/cleaned_dataset.csv', index=False)

In [46]:
# Check how many names are blank or missing
print("Missing names (NaN):", df['Name'].isnull().sum())

print("Empty or space-only names:",
      df['Name'].apply(lambda x: isinstance(x, str) and x.strip() == "").sum())

Missing names (NaN): 240
Empty or space-only names: 0

In [47]:
# Drop rows with NaN, empty, or space-only names
df = df[df['Name'].notnull()]                     # remove NaN
df = df[df['Name'].str.strip() != ""]             # remove empty or spaces

In [48]:
# Fill with a placeholder name
df['Name'] = df['Name'].fillna('Unknown')
df['Name'] = df['Name'].apply(lambda x: 'Unknown' if str(x).strip() == '' else x)

In [49]:
# Clean and format names
df['Name'] = df['Name'].str.replace(r'[^a-zA-Z\s]', '', regex=True)  # remove symbols/numbers
df['Name'] = df['Name'].str.strip().str.title()

In [50]:
# Check for missing, empty, or whitespace-only names
blank_names = df[df['Name'].isnull() | (df['Name'].str.strip() == "")]
print("Total blank or missing names:", blank_names.shape[0])
blank_names.head()

Total blank or missing names: 0

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [51]:
# Remove rows with blank or missing names
df = df[df['Name'].notnull()]                     # Remove NaN
df = df[df['Name'].str.strip() != ""]             # Remove empty or whitespace

In [52]:
# Remove symbols and apply title case
df['Name'] = df['Name'].str.replace(r'[^a-zA-Z\s]', '', regex=True)
df['Name'] = df['Name'].str.strip().str.title()

In [53]:
df['Name'].head(25)

9                     Jay Fisher
42               Kayla Carpenter
43                 Laura Douglas
49               Richard Collins
51                   John Bailey
59                 Jessica Evans
63          Mrs Sheri Duffyparty
71          Allison Mcknighttrip
90     Mrs Betty Robinsonmission
97                  Steven Kirby
99                  Nicholas May
108                   Stacy Cruz
109                 Kevin Fowler
110                   Sydney Cox
113               Heather Taylor
132                Michael Allen
138                Michael Weber
143           Gabrielle Castillo
149                Wendy Schmidt
175         George Fullermission
179               Kimberly Terry
183                Donald Patton
196                  Austin Pugh
201              Danielle Morton
207                 John Randall
Name: Name, dtype: object

In [54]:
# Replace NaN (missing) and empty/whitespace names with 'Unknown'
df['Name'] = df['Name'].fillna('Unknown')
df['Name'] = df['Name'].apply(lambda x: 'Unknown' if str(x).strip() == '' else x)

In [55]:
# Clean and standardize names
df['Name'] = df['Name'].str.replace(r'[^a-zA-Z\s]', '', regex=True)
df['Name'] = df['Name'].str.strip().str.title()

In [56]:
# Preview cleaned names
df['Name'].value_counts().head(10)

Name
Steven Jones              3
John Smith                2
Michelle Jones            2
Joseph Rodriguez          2
Jessica Osborne           2
Jennifer Baker            2
Christopher Richardson    2
Laura Walker              2
Jennifer Lee              2
Thomas Robinson           2
Name: count, dtype: int64

In [57]:
# Save cleaned data
df.to_csv('../data/cleaned_dataset.csv', index=False)

print("Cleaned file saved to ../data/cleaned_dataset.csv")

Cleaned file saved to ../data/cleaned_dataset.csv

In [58]:
# Ensure Age column is numeric
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

# Filter rows where Age has decimal values (i.e., not whole numbers)
decimal_ages = df[df['Age'] % 1 != 0]

# Show those rows
decimal_ages.head()

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
179,179,182b6c7c-2121-428a-87b9-63aac3a123ae,Kimberly Terry,54.036516,christopher00@thomas-anderson.com,2024-05-26,111038.000000,Engineering
269,269,d13d6f3e-dff7-4fa9-b5ee-9a613dd6b04a,Dr Alex Collins,54.036516,wcummings@williams.com,2020-05-18,56932.000000,Unknown
272,272,fc9e2e88-5ab4-4a23-b584-f3c80f8bcb1f,Derrick Bridges,54.036516,patelsylvia@lynn.com,2022-12-07,41810.000000,SupportC
345,345,b1622b91-2b7c-4ec6-894d-bb541b61de3e,Kevin Williams Md,54.036516,garcianicholas@hill-ali.info,2023-11-20,149457.000000,Sales
679,679,63ebc25e-d83c-4af5-8342-ff380c914163,Laura Leon,54.036516,sabrina28@carroll.com,2023-01-25,36193.487308,Marketing

In [59]:
df = df[df['Age'] % 1 == 0]

In [60]:
# Save cleaned data
df.to_csv('../data/cleaned_dataset.csv', index=False)

print("Cleaned file saved to ../data/cleaned_dataset.csv")

Cleaned file saved to ../data/cleaned_dataset.csv

In [61]:
# Ensure Salary column is numeric
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

# Find rows where Salary has decimal values
decimal_salary = df[df['Salary'] % 1 != 0]

# Show rows with decimal salaries
decimal_salary.head()

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
9,9,d06f507d-62e5-4bd6-a252-4e60e109d324,Jay Fisher,44.0,denisemaynard@jordan.com,2022-12-08,37701.725993,HR
42,42,3a6b1096-f7a7-4901-a31a-9db676895801,Kayla Carpenter,61.0,dcooper@adams.net,2021-06-08,82857.398040,Engineering
71,71,ca130e73-2fc6-4c24-aaaa-3b08038f2666,Allison Mcknighttrip,90.0,hsmith@munoz-snyder.com,2022-12-24,105919.658059,HR
97,97,8bfbae3a-81de-4658-9fcf-1522a4ffb162,Steven Kirby,49.0,barkerdavid@watson.org,2020-01-19,63896.102483,HR
108,108,edb34b86-369f-4cd2-b4c8-dc2c6eb0ffc5,Stacy Cruz,36.0,williampearson@snyder.com,2020-02-11,118523.380275,Marketing

In [62]:
df['Salary'] = df['Salary'].round()

In [63]:
# Check salary distribution
df['Salary'].describe()

# View salaries less than ₹1,000 or more than ₹3,00,000
outliers = df[(df['Salary'] < 1000) | (df['Salary'] > 300000)]
outliers.head()

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [64]:
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

In [65]:
df = df[df['Age'] <= 65]

In [66]:
df = df.dropna(subset=['Age'])

In [67]:
# Save cleaned data
df.to_csv('../data/cleaned_dataset.csv', index=False)

print("Cleaned file saved to ../data/cleaned_dataset.csv")

Cleaned file saved to ../data/cleaned_dataset.csv